app/controllers/students_controller.rb

INSERT INTO "students" ("name", "age", "gender", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "A"], ["age", 12], ["gender", "t"], ["created_at", "2021-06-10 01:55:08.127571"], ["updated_at", "2021-06-10 01:55:08.127571"]]
---
  def create
    @student = Student.new(student_params)

    if @student.save

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "students" SET "age" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["age", 231], ["updated_at", "2021-06-10 02:56:36.455392"], ["id", 2]]
---
  def update
    @student = Student.find(params[:id])

    if @student.update(student_params)